Revit 2026 API

# FilterRule Properties

---

The FilterRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FilterRule Class

Autodesk.Revit.DB Namespace